Documents/КорректировкаНазначенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаНазначенияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Document.ЗаказНаСборку</xr:Item>
				<xr:Item>Document.ЗаказНаПеремещение</xr:Item>
				<xr:Item>Document.ЗаказНаВнутреннееПотребление</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПоНДС</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасходы</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииПрочихРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеАктивыПассивы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииНДСКРаспределению</xr:Item>
				<xr:Item>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияНоменклатураНоменклатура</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
				<xr:Item>AccumulationRegister.ПартииЗатратНаВыпуск</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыЗапасовУказаныВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКорректировкиНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходноеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовоеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходноеНазначениеДвиженияПоСкладскимРегистрам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатурыОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйЗаказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйЗаказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролируемаяПартия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодтвержденияКачества</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодлежитРазблокировке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЗапасов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатурыОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗапасовОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовоеНазначениеПустое</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Дополнительный реквизит</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение дополнительного реквизита</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Comment>Полный текст строкового дополнительного реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыНазначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНазначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Собственное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Давальческое21</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДавальческоеПродукция22</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДавальческоеМатериалы22</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДавальческоеМатериалыПодЭтап22</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Давальческое2_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаПодПринципала</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Назначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Назначения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНазначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвиженияПоСкладскимРегистрам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьТолькоНаличие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСтавкиНДС</Name>
					<Comment>Формировать отчеты о закупках под принципала по ставкам НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/КорректировкаНазначенияТоваров/Forms/УказаниеНазначенийВТабличнойЧасти/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Упаковка = Параметры.Упаковка;
	Если Не ЗначениеЗаполнено(Упаковка) Тогда
		Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Номенклатура, "ЕдиницаИзмерения");
	КонецЕсли;
	
	ЗаполнитьТаблицу();
	УстановитьЗаголовкиПриСозданииФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодбиратьТоварыПриИзменении(Элемент)
	
	ЗаполнитьТаблицу();
	ОбновитьПодобрано();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаНазначений

&НаКлиенте
Процедура ТаблицаПриАктивизацииЯчейки(Элемент)

	Если Элемент.ТекущийЭлемент.Имя = Элементы.ТаблицаПереместитьВправо.Имя Тогда
		ТекущиеДанные = Элементы.ТаблицаНазначений.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.Подобрано = ТекущиеДанные.ВНаличии;
			ОбновитьПодобрано();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодобраноПриИзменении(Элемент)
	
	ОбновитьПодобрано();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Подобрано = ТаблицаНазначений.Итог("Подобрано");
	Если Подобрано <> Параметры.Подобрать Тогда
		Шаблон = НСтр("ru = 'Подобранное количество (%1 %3) не совпадает с количеством, которое необходимо подобрать (%2 %3). Команда не может быть выполнена.'");
		Текст = СтрШаблон(
			Шаблон,
			Формат(Подобрано, "ЧДЦ=3; ЧН=0,000;"),
			Формат(Параметры.Подобрать, "ЧДЦ=3; ЧН=0,000;"),
			Упаковка);
		ПоказатьПредупреждение(, Текст);
		Возврат;
	КонецЕсли;
	Результат = Новый Структура("ПодобранныеТовары", ПодобранныеТовары());
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицу()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Склад КАК Склад,
		|	Запасы.Назначение КАК Назначение,
		|	Запасы.Заказ КАК Заказ,
		|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
		|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
		|	Запасы.КРазблокировкеОстаток КАК КРазблокировкеОстаток,
		|	Запасы.РезервироватьНаСкладеИзЗаблокированныхОстаток КАК РезервироватьНаСкладеИзЗаблокированныхОстаток,
		|	Запасы.РезервироватьПоМереПоступленияИзЗаблокированныхОстаток КАК РезервироватьПоМереПоступленияИзЗаблокированныхОстаток,
		|	Запасы.РезервироватьНаСкладеОстаток КАК РезервироватьНаСкладеОстаток,
		|	Запасы.РезервироватьПоМереПоступленияОстаток КАК РезервироватьПоМереПоступленияОстаток,
		|	Запасы.ОтложитьРезервированиеОстаток КАК ОтложитьРезервированиеОстаток,
		|	Запасы.КОбеспечениюОстаток КАК КОбеспечениюОстаток,
		|	Запасы.НеОбеспечиватьОстаток КАК НеОбеспечиватьОстаток
		|ПОМЕСТИТЬ ЗапасыИПотребностиОстаткиКонтролируемыхПартий
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
		|		Номенклатура = &Номенклатура
		|			И Характеристика = &Характеристика
		|			И Склад = &Склад
		|			И Назначение <> &НазначениеПолучатель
		|			И Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			И &ПолучатьОстаткиПартий) КАК Запасы
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение
		|;
		|
		|////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Склад КАК Склад,
		|	Запасы.Назначение КАК Назначение,
		|	Запасы.ВНаличииОстаток КАК ВНаличииОстаток,
		|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
		|	Запасы.ЗаказаноОстаток КАК ЗаказаноОстаток,
		|	Запасы.ПоступитОстаток КАК ПоступитОстаток,
		|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
		|	Запасы.РезервироватьНаСкладеОстаток КАК РезервироватьНаСкладеОстаток,
		|	Запасы.РезервироватьПоМереПоступленияОстаток КАК РезервироватьПоМереПоступленияОстаток,
		|	Запасы.ОтложитьРезервированиеОстаток КАК ОтложитьРезервированиеОстаток,
		|	Запасы.КОбеспечениюОстаток КАК КОбеспечениюОстаток,
		|	Запасы.НеОбеспечиватьОстаток КАК НеОбеспечиватьОстаток
		|ПОМЕСТИТЬ ЗапасыИПотребностиОстатки
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
		|		Номенклатура = &Номенклатура
		|			И Характеристика = &Характеристика
		|			И Склад = &Склад
		|			И Назначение <> &НазначениеПолучатель
		|			И Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Запасы
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение
		|;
		|
		|////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Назначение КАК Назначение,
		|	Таблица.КонтролируемаяПартия КАК КонтролируемаяПартия,
		|	Таблица.КонтролируемаяПартия <> ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка) КАК НаКонтроле,
		|	Таблица.КоличествоДляДействияОтгрузить КАК ВНаличии,
		|	ЕСТЬNULL(
		|		ВЫБОР
		|			КОГДА ОбеспечениеТоварамиПроверенногоКачества.КоличествоДляДействияОтгрузить > 0
		|				ТОГДА ОбеспечениеТоварамиПроверенногоКачества.КоличествоНаСкладеДляДействияРезервироватьПоМереПоступления
		|						- ОбеспечениеТоварамиПроверенногоКачества.КоличествоДляДействияОтгрузить
		|			КОГДА ОбеспечениеТоварамиПроверенногоКачества.КоличествоНаСкладеДляДействияРезервироватьПоМереПоступления > 0
		|				ТОГДА ОбеспечениеТоварамиПроверенногоКачества.КоличествоНаСкладеДляДействияРезервироватьПоМереПоступления
		|			ИНАЧЕ 0
		|		КОНЕЦ, 0) КАК ДоступноПоВсемПартиям
		|ИЗ
		|	ДанныеОбеспечения КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОбеспечения КАК ОбеспечениеТоварамиПроверенногоКачества
		|		ПО ОбеспечениеТоварамиПроверенногоКачества.Номенклатура =Таблица.Номенклатура
		|		 И ОбеспечениеТоварамиПроверенногоКачества.Характеристика = Таблица.Характеристика
		|		 И ОбеспечениеТоварамиПроверенногоКачества.Склад = Таблица.Склад
		|		 И ОбеспечениеТоварамиПроверенногоКачества.Назначение = Таблица.Назначение
		|		 И ОбеспечениеТоварамиПроверенногоКачества.КонтролируемаяПартия = ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка)
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК НазначениеПолучатель
		|		ПО НазначениеПолучатель.Ссылка = &НазначениеПолучатель
		|ГДЕ
		|	ВЫБОР
		|		КОГДА
		|			НазначениеПолучатель.ТипНазначения В(
		//++ Устарело_Переработка24
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ДавальческоеМатериалы22),
		//-- Устарело_Переработка24
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ДавальческоеМатериалыПодЭтап22))
		|			ТОГДА
		|				Таблица.Назначение.ТипНазначения В(
		//++ Устарело_Переработка24
		|							ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ДавальческоеМатериалы22),
		//-- Устарело_Переработка24
		|							ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ДавальческоеМатериалыПодЭтап22))
		|						И НазначениеПолучатель.Партнер = Таблица.Назначение.Партнер
		|						И НазначениеПолучатель.Договор = Таблица.Назначение.Договор
		|					ИЛИ Таблица.Назначение.ТипНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.Собственное)
		|		ИНАЧЕ
		|			НЕ Таблица.Назначение.ТипНазначения В(
		//++ Устарело_Переработка24
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ДавальческоеПродукция22),
		//-- Устарело_Переработка24
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ПоставкаПодПринципала))
		|	КОНЕЦ
		|	И Таблица.КоличествоДляДействияОтгрузить > 0
		|УПОРЯДОЧИТЬ ПО
		|	Назначение, НаКонтроле, ВНаличии УБЫВ";
	
	ИменаТаблиц = ОбеспечениеВДокументахСервер.НовыеИменаТаблицДляРасчетаОстатковДляУстановкиДействий();
	ИменаТаблиц.Остатки = "ЗапасыИПотребностиОстатки"; // @query-part-1
	ИменаТаблиц.ОстаткиКонтролируемыхПартий = "ЗапасыИПотребностиОстаткиКонтролируемыхПартий"; // @query-part-1
	ИменаТаблиц.Результат = "ДанныеОбеспечения"; // @query-part-1
	ОбеспечениеВДокументахСервер.ДанныеОбеспечения(ТекстЗапроса, ИменаТаблиц);
	
	ЭтоПодборПартий = ПодбиратьТовары = ПодбиратьТоварыЗначениеВсе();
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Параметры.Характеристика);
	Запрос.УстановитьПараметр("Склад", Параметры.Склад);
	Запрос.УстановитьПараметр("НазначениеПолучатель", Параметры.Назначение);
	Запрос.УстановитьПараметр("ПолучатьОстаткиПартий", ЭтоПодборПартий);
	Результат = Запрос.Выполнить().Выгрузить();
	ТаблицаНазначений.Очистить();
	ТаблицаНазначений.Загрузить(Результат);
	
	КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Упаковка, Параметры.Номенклатура);
	Для Каждого Строка Из ТаблицаНазначений Цикл
		Строка.ВНаличии = Строка.ВНаличии / КоэффициентУпаковки;
		Строка.ДоступноПоВсемПартиям = Строка.ДоступноПоВсемПартиям / КоэффициентУпаковки;
	КонецЦикла;
	
	Элементы.ТаблицаКонтролируемаяПартия.Видимость = ЭтоПодборПартий;
	Элементы.ГруппаИтоги.Видимость = ЭтоПодборПартий;
	Элементы.ТаблицаНаКонтроле.Видимость = ЭтоПодборПартий;
	Элементы.ПеренестиВДокумент.Доступность = ТаблицаНазначений.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиПриСозданииФормы()
	
	Элементы.ТаблицаВНаличии.Заголовок = СтрШаблон(Элементы.ТаблицаВНаличии.Заголовок, Упаковка);
	Элементы.ТаблицаПодобрано.Заголовок = СтрШаблон(Элементы.ТаблицаПодобрано.Заголовок, Упаковка);
	
	Если ЗначениеЗаполнено(Параметры.Характеристика) Тогда
		Заголовок = НСтр("ru = 'Указание назначений для товара: %1,%3 на складе: %2'");
		Заголовок = СтрШаблон(Заголовок, Параметры.Номенклатура, Параметры.Склад, Параметры.Характеристика);
	Иначе
		Заголовок = НСтр("ru = 'Указание назначений для товара: %1 на складе: %2'");
		Заголовок = СтрШаблон(Заголовок, Параметры.Номенклатура, Параметры.Склад);
	КонецЕсли;
	
	Элементы.ДекорацияПодобрать.Заголовок = СтрШаблон(Элементы.ДекорацияПодобрать.Заголовок,
		Формат(Параметры.Подобрать, "ЧДЦ=3; ЧН=0,000;"), Упаковка);
	Подобрано = ТаблицаНазначений.Итог("Подобрано");
	Элементы.ДекорацияПодобрано.Заголовок = СтрШаблон(НСтр("ru = 'Подобрано: %1 %2'"),
		Формат(Подобрано, "ЧДЦ=3; ЧН=0,000;"), Упаковка);
	
КонецПроцедуры

&НаСервере
Функция ПодобранныеТовары()
	
	Результат = ТаблицаНазначений.Выгрузить(Новый Массив(), "Назначение,КонтролируемаяПартия,Подобрано");
	
	Для Каждого Строка Из ТаблицаНазначений Цикл
		Если Строка.Подобрано > 0 Тогда
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), Строка);
		КонецЕсли;
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(Результат);
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПодобрано()
	
	Подобрано = ТаблицаНазначений.Итог("Подобрано");
	Элементы.ДекорацияПодобрано.Заголовок = СтрШаблон(НСтр("ru = 'Подобрано: %1 %2'"),
		Формат(Подобрано, "ЧДЦ=3; ЧН=0,000;"), Упаковка);
	
КонецПроцедуры

&НаСервере
Функция ПодбиратьТоварыЗначениеВсе()
	
	Возврат 1;
	
КонецФункции

#КонецОбласти
